# (5). lambda식으로 데이터 가공

## 1. 개요

* lambda식: 함수의 선언과 함수 내의 처리를 한줄의 식으로 변환할 수 있다.

#### 예시:

In [1]:
def get_square(a):
    return a**2

print('3의 제곱은?:',get_square(3))

3의 제곱은?: 9

In [2]:
lambda_sq = lambda x : x**2
# 왼쪽: 입력인자, 오른쪽: 반환값

print('3의 제곱은?:',lambda_sq(3))

3의 제곱은?: 9

### 1-1. map() - 여러 개의 값을 인자로 사용할 때

In [3]:
a = [1,2,3]
squares = map(lambda x: x**2,a)
list(squares)

[1, 4, 9]

## 2. DataFrame에서의 활용

### 2-1. apply로 활용하기
---

In [4]:
import pandas as pd
titanic_df = pd.read_csv(r'../data/titanic_train.csv')

titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x:len(x))
titanic_df[['Name','Name_len']].head(3)

                                                Name  Name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22

### 2-2. lambda식에 if else절 넣기
---
반환값 다음에 if 조건을 써야하므로 주의. else if는 지원하지 않는다. 따라서 복잡한 if절을 쓰기엔 다소 복잡.

In [5]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x:'Child' if x<=15 else 'Adult')
titanic_df[['Age','Child_Adult']].head(8)

    Age Child_Adult
0  22.0       Adult
1  38.0       Adult
2  26.0       Adult
3  35.0       Adult
4  35.0       Adult
5   NaN       Adult
6  54.0       Adult
7   2.0       Child

복잡한 조건을 써야할 경우 아예 조건을 별도의 함수에 만드는게 낫다.

In [6]:
def age_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else : cat = 'Elderly'
        
    return cat

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x:age_category(x))
titanic_df[['Age','Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult